package d0904;

import java.util.HashSet;
import java.util.Set;

public class Info {

	public static void main(String[] args) {
		
		// 학생, 교사 공통 부모가 있음
		// 인스턴스 생성 차단 -> 인터페이스
		
		// -- 학생 필드 -- 
//		 학생 번호
//		 반이 정해져 있음 (A,B,C) 
//		 이름 있음 
//		 필수 수강 과목 있음 : (국어, 수학, Java)
//		 선택 수강 과목 : (SQL, HTML)
//		 성별
//		 담임 교사 정보
		
		// -- 학생 메소드 --
		// 필수, 선택 수강 과목 setter
		// 필수 수강 과목 getter
		
		// -- 담임 교사 필드 --
//		 담당 반
//		 이름
//		 지도 과목
//		 성별
//		 반 학생들 정보
		
		// -- 담임 교사 메소드 --
//		 학생별 필수 수강 과목 평균 점수
//		 SQL 선택 과목을 수강하는 남학생 수
//		 반 전체 학생 수 대비 남/여 학생 수
		
		// -- 학교 메소드(추상) --
		
		
		// -- 얻고 싶은 데이터 --
//		 학생들 정보 일괄 뽑을 때 ArrayList 사용해라
//		 "철수" 쌤 반 학생 수
//		 전체 학생 수 대비 남/여 학생수
//		 "영희"라고 하는 학생의 필수 수강 과목 평균 점수
//		 SQL 선택 과목을 수강하는 남학생 수
//		 A반 학생들의 필수 과목 평균 -> 60점 이상, 과락점수 40점, pass -> 통과하지 못한 학생들의 명단
//		 필수 과목을 점수로 처리해도 된다.
		
		// 반으로 묶으면 되나?
		// 교사 먼저 생성
		// 학생 생성
	}

}
